//======================================================================
// 文件名称：main.c（应用工程主函数）
// 框架提供：苏大嵌入式（sumcu.suda.edu.cn）
// 更新记录：20230601-20241109
// 功能描述：见本工程的01_Doc\Readme.txt
// 移植规则：【固定】本工程07_AppPrg整个文件夹具备芯片无关性，差异体现在
//           05_UserBoard文件夹的User.h中
//======================================================================
#define GLOBLE_VAR     //【固定】includes.h定义的全局变量一处声明多处使用
#include "includes.h"  //【固定】包含总头文件

//main.c使用的内部函数声明处---------------------------------------------

//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程）-----------
int main(void)  //main函数（开头）
{
    printf("------------------------------------------------------------\n");   
    printf("★金葫芦提示★                                               \n");
    printf("【中文名称】GEC的NOS编程框架（PWM构件测试样例）               \n");
	printf("【程序功能】                                                 \n");
	printf("     ① 程序改变PWM占空比，蓝灯跟随变化；                     \n");
	printf("     ② 运行PWM-测试程序C#，观察PWM波形                       \n");
    printf("【硬件连接】见本工程05_UserBoard文件夹下user.h文件            \n");
    printf("【操作说明】运行PC方的PWM-测试程序C#                         \n");
    printf("-----------------------------------------------------------\n\0"); 
    //【1】======启动部分【开头】==========================================
    //【1.1】声明main函数使用的局部变量
    double   mduty;         //占空比
    uint32_t mCount;        //PWM高低电平个数
    uint8_t  mPWM_state;    //PWM状态标志
    uint8_t  mFlag;         //电平切换标志

    //【1.2】【不变】关总中断
    DISABLE_INTERRUPTS;

    //【1.3】【根据本函数所用的变量赋初值】给主函数使用的局部变量赋初值
    mduty = 0.0;        //占空比
    mCount = 0;         //PWM高低电平个数
    mFlag=0;            //电平切换标志初始状态为1   

    //【1.4】给全局变量赋初值

    //【1.5】【根据所用到的外部硬件设备】进行用户外设模块初始化化
    gpio_init(LIGHT_BLUE,GPIO_OUTPUT,LIGHT_OFF);    //初始化蓝灯
    //PWM输出初始化     时钟频率  PWM周期   占空比  对齐方式   极性 
    pwm_init(PWM_USER, 3000,   1000,     10.0,   PWM_EDGE, PWM_PLUS);  

    //【1.6】使能模块中断

    //【1.7】【不变】开总中断
    ENABLE_INTERRUPTS;

    //【1】======启动部分【结尾】==========================================w

    //【2】======主循环部分【开头】========================================
    while (1)   //while循环【开头】
    {
        //（2.1）打出PWM波
        if (mCount >= 7)
        {
            mCount = 0;
            mFlag = 1;
            mduty= mduty+10.0;
            pwm_update(PWM_USER, mduty);
            printf("占空比=%d, 观察蓝灯,运行PWM-C#！\r\n", (int)mduty);
            if ((int)mduty >= 90)  mduty = 0.0;
        }
        //（2.2）获得PWM引脚的状态
        mPWM_state = gpio_get(INCAP_USER);


        //（2.3）根据PWM引脚状态控制蓝灯、printf输出
        if ((mPWM_state == 1) && (mFlag == 1))
        {
            mFlag = 0;
            mCount=mCount+1;
            if  (mCount>=7)  continue;
            gpio_set(LIGHT_BLUE,1);
            printf("高电平：1\n");
        } 
        if ((mPWM_state == 0) && (mFlag == 0))
        {
            mFlag = 1;
            mCount=mCount+1;
            gpio_set(LIGHT_BLUE,0);
            printf("低电平：0\n");
        }
    }  //while循环结尾
    //【2】======主循环部分【结尾】========================================
}   //main函数【结尾】


//======以下为主函数调用的子函数===========================================


//=========================================================================
/*
知识要素：
【1】main.c是一个模板，该文件所有代码均不涉及具体的硬件和环境，通过调用构件
实现对硬件的干预。
【2】本文件中对宏GLOBLE_VAR进行了定义，所以在包含"includes.h"头文件时，会定
义全局变量，在其他文件中包含"includes.h"头文件时，
编译时会自动增加extern
*/





