//===========================================================================
//文件名称：SysTick.c
//功能概要：SysTick模块底层驱动构件源程序文件
//版权所有：苏大嵌入式(sumcu.suda.edu.cn)
//版本更新：20240601-20240801
//适用芯片：CH573
//===========================================================================

#include"systick.h"
//======================================================================
//函数名称：systick_init
//函数返回：无
//参数说明：int_ms:中断的时间间隔。单位ms 推荐选用5,10,......
//功能概要：初始化SysTick模块，设置中断的时间间隔，以ms为单位
//参数范围：1ms-1000ms
//======================================================================
void systick_init(uint32_t int_ms)
{
    //【1】参数保护
    if ((int_ms) > 1000) int_ms=1000;
    //【2】设定中断优先级（15）
    PFIC_SetPriority(SysTick_IRQn,0xf0);
    //【3】复位SysTick定时器  
    SysTick->CTLR = 0;               
    SysTick->CNT = 0;            
    //【4】设置重载寄存器（时钟源频率60MHz）
    SysTick->CMP =60000*int_ms;  
    //【5】选择时钟源、设置重载寄存器、允许中断、启动计数
    SysTick->CTLR = 0x0106;    //选择时钟源、设置重载寄存器、允许中断
    SysTick->CTLR|= 0x01;      //启动计数
    //【6】开放模块中断
    PFIC_EnableIRQ(SysTick_IRQn);
}

//======================================================================
//函数名称：systick_clear_int
//函数返回：无
//参数说明：无
//功能概要：清除systick中断标志
//======================================================================
void systick_clear_int(void)
{
    SysTick->CNTFG = 0;    //清除"计数器减为0标志位"
}