//===========================================================================
//文件名称：SysTick.h
//功能概要：SysTick模块底层驱动构件头文件
//版权所有：苏大嵌入式(sumcu.suda.edu.cn)
//版本更新：20240601-20240802
//适用芯片：CH573
//===========================================================================

#ifndef SYSTICK_H   //防止重复定义（开头）
#define SYSTICK_H

#include <mcu.h>     //包含公共要素头文件
//===========================================================================
//函数名称：systick_init
//函数返回：无
//参数说明：int_ms:中断的时间间隔。单位ms 推荐选用5,10,......
//功能概要：初始化SysTick模块，设置中断的时间间隔,以ms为单位
//参数范围：1ms-1000ms
//===========================================================================
void systick_init(uint32_t int_ms);

//===========================================================================
//函数名称：systick_clear_int
//函数返回：无
//参数说明：无
//功能概要：清除systick中断标志
//===========================================================================
void systick_clear_int(void);

#endif    //防止重复定义（结尾）
