//======================================================================
// 文件名称：main.c（应用工程主函数）
// 框架提供：苏大嵌入式（sumcu.suda.edu.cn）
// 更新记录：20230601-20240730
// 功能描述：见本工程的01_Doc\Readme.txt
// 移植规则：【固定】本工程07_AppPrg整个文件夹具备芯片无关性，差异体现在
//           05_UserBoard文件夹的User.h中
//======================================================================
#define GLOBLE_VAR     //【固定】includes.h定义的全局变量一处声明多处使用
#include "includes.h"  //【固定】包含总头文件

//main.c使用的内部函数声明处---------------------------------------------

//----------------------------------------------------------------------
//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程）
int main(void)
{
	printf("------------------------------------------------------\n");
	printf("★金葫芦提示★                                         \n");
    printf("【中文名称】直观了解补码                                \n");
	printf("【程序功能】                                           \n");
	printf("         ① 蓝色闪烁；                                 \n");
	printf("         ② 输出补码。                                 \n");
    printf("---------------------------------------------------\n\n\0"); 
     
    //【1】启动部分（开头）==============================================
    //（1.1）【根据本函数所用的变量声明】声明main函数使用的局部变量
    vuint32_t mMainLoopCount;     //主循环次数变量（主循环临时变量以m作为前缀）
    uint8_t   mFlag;              //灯的状态标志
    uint32_t  mLightCount;        //灯的状态切换次数
    
    //（1.2）【不变】关总中断
    DISABLE_INTERRUPTS;
    
    //（1.3）【根据本函数所用的变量赋初值】给主函数使用的局部变量赋初值
    mMainLoopCount=0;    //主循环次数变量
    mFlag='A';           //灯的状态标志
    mLightCount=0;       //灯的闪烁次数
    
    //（1.4）【根据includes.h文件中声明的全局变量】给全局变量赋初值
    g_x1=0;  
   
    //（1.5）【根据所用到的外部硬件设备】进行用户外设模块初始化
    //（1.5.1）初始化蓝灯 
    gpio_init(LIGHT_BLUE,GPIO_OUTPUT,LIGHT_ON);	
    //（1.5.2）串口初始化
    uart_init(UART_Debug, 115200);
    uart_init(UART_User, 115200);

    //（1.6）【根据所使用的硬件模块中断】使能模块中断
    uart_enable_re_int(UART_Debug);     //使能BIOS串口接收中断
    uart_enable_re_int(UART_User);      //使能用户串口接收中断

    //（1.7）【不变】开总中断
    ENABLE_INTERRUPTS;

//【1】启动部分（结尾）================================================

//【2】主循环部分（开头）==============================================
   while(1)   //while无限循环（开头）
   {
       //（2.1）主循环次数变量+1
       mMainLoopCount++;
       //（2.2）未达到主循环次数设定值，继续循环
       if (mMainLoopCount<=MAINLOOP_COUNT) continue; //宏常数在user.h中定义
       //（2.3）达到主循环次数设定值，执行下列语句，进行灯的亮暗处理
       //（2.3.1）清除循环次数变量
       mMainLoopCount=0; 
       //（2.3.2）根据灯的状态标志mFlag是否'L'进行操作
       if (mFlag=='L')  //若为'L'，置灯亮，灯闪烁次数+1，改变灯状态标志
       {
           gpio_set(LIGHT_BLUE,LIGHT_ON);      //置灯亮
           printf(" LIGHT_BLUE:ON   \n");      //输出提示
           mLightCount++;                       //灯闪烁次数+1
           printf(" 灯闪烁次数mLightCount = %d\n\n",mLightCount);
           mFlag='A';   //改变灯状态标志为'A'，下一循环使用
        }
        else            //若不为'L'（即为'A')
        {
           gpio_set(LIGHT_BLUE,LIGHT_OFF);
           printf(" LIGHT_BLUE:OFF  \n");  
           mFlag='L';            
        }
        //（2.3.3）打印输出负整数的实际存储值
        printf("======================\n");
        g_x1=g_x1-1;
        printf("数据（用十进制有符号数表达）g_x1=%d\n",g_x1);
        printf("实际存储情况（用十六制表达）g_x1=%x\n",g_x1);
        if (g_x1==-100) g_x1=0;
         
    }  //while无限循环（结尾）
//【2】主循环部分（结尾）=============================================
}   //main函数（结尾）


//======以下为主函数调用的子函数===========================================


//========================================================================
/*
 知识要素：
 （1）main.c是一个模板，该文件所有代码均不涉及具体的硬件和环境，通过调用构件
      实现对硬件的干预。
 （2）本文件中对宏GLOBLE_VAR进行了定义，所以在包含"includes.h"头文件时，会定
      义全局变量，在其他文件中包含"includes.h"头文件时，
      编译时会自动增加extern
 */
